# NewTypeBinding Method (CategorySet) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewTypeBinding Method (CategorySet)
Application Class See Also
---
Creates a new type binding object containing the categories passed as a parameter.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TypeBinding NewTypeBinding(
	CategorySet categorySet
)
```

Visual Basic
---
```text
Public Function NewTypeBinding ( _
	categorySet As CategorySet _
) As TypeBinding
```

Visual C++
---
```text
public:
TypeBinding^ NewTypeBinding(
	CategorySet^ categorySet
)
```

# ### Parameters
categorySet
    Type: Autodesk.Revit.DB..::..CategorySetA set of categories that will be added to the binding.
# ### Return Value
A new type binding object.
# Remarks
Type binding objects are used for attaching shared parameter definitions to a type within a category.
# See Also
Application Class
NewTypeBinding Overload
Autodesk.Revit.Creation Namespace